import React from "react";
import PropTypes from "prop-types";

class Faq extends React.Component {
    render() {
        return (
            <div className="faq">
                <div className="content-box">
                    <h2>Відповіді на часті питання про буріння свердловин</h2>
                    <div className="questions">{this.renderFaq(questions)}</div>
                    <div className="btns">
                        <div
                            className="btn "
                            onClick={() => {
                                this.props.clickCall();
                            }}
                        >
                            Зателефонувати
                        </div>
                        <div
                            className="btn btn-third"
                            onClick={() => {
                                this.props.openLayer();
                            }}
                        >
                            Замовити дзвінок
                        </div>
                    </div>
                </div>
            </div>
        );
    }
    renderFaq(arr) {
        return arr.map((item, index) => {
            return (
                <div className="question" key={index}>
                    <div className="title">
                        <i className="icon-star-filled" />
                        {item.title}
                    </div>
                    <div className="answer">{item.answer}</div>
                </div>
            );
        });
    }
}

export default Faq;

const questions = [
    {
        title: "Чи надає ваша компанія документи на буріння свердловини?",
        answer: "Наша компанія є гарантом і бере на себе регулювання технічний процес буріння. Ми надаємо сертифікати та дозволи, а також паспорт на свердловину.",
    },
    {
        title: "Як визначити глибину свердловини?",
        answer: "Наші фахівці дуже ретельно підходять до етапу проектування свердловини. Коли потрібно розрахувати її глибину в справу підключаються кадастрові документи на ділянці, щоб максимальною точністю визначити обсяг робіт та надати замовнику кошторис.",
    },
    {
        title: "Що входить у вартість свердловини ?",
        answer: "Стандартна послуга буріння свердловин ціна за метр включає: виїзд інженера на ділянку, подачу бурильної техніки, підготовчі роботи, буріння та прокачування води.",
    },
    {
        title: "Чи правда, що пробурити свердловину взимку буде дешевшим?",
        answer: "Так це так! Пробурити свердловину  взимку, завдяки тому, що ґрунт менш розсипчастий і добре тримає форму простіше. Буріння можна без перешкод виробляти навіть на ділянках з високим рівнем залягання вод або болотистих територіях.",
    },
    {
        title: "Як здійснити буріння свердловини на малогабаритній ділянці зі садом?",
        answer: "Пробурити свердловину на заставленій невеликій ділянці - не проблема. Для таких робіт ми використовуємо малогабаритні бурильні установки чи ручне буріння свердловин. Ґрунт який залишиться після буріння, ми одразу ж прибираємо, а вода автоматично відкачується в ємність, встановлену на автомобілі.",
    },
    {
        title: "Що таке кесон і чи потрібен він мені?",
        answer: "Кесон - це порожня конструкція, яка виконує захисні функції та встановлюється над свердловиною.",
    },
];
