import { ReactComponent as LogoSvg } from "../svg/Logo.svg";

export default function NewAbout(props) {
    return (
        <div className="about">
            <div className="content-box">
                <div className="left">
                    <h2>Про нас</h2>
                    <p>
                        Багаторічний досвід нашої компанії дозволяє з
                        упевненістю заявити - ми найкращі у своїй галузі! За
                        роки своєї роботи ми придбали безліч клієнтів по всій
                        Україні та підтверджуємо бездоганність репутації
                        щоденною працею. Пропонується оперативна та професійна
                        послуга – буріння свердловин , яка позбавить вас
                        необхідності вникати в складний технічний процес.
                    </p>
                    <p>
                        Ми готові надати бурильні роботи на максимально вигідні
                        для клієнта умов. Менеджери в режимі онлайн або шляхом
                        телефонних переговорів нададуть попередню консультацію
                        та оформлять заявку на виїзд майстра.
                    </p>
                </div>
                <div className="right">
                    <div className="logo">
                        <LogoSvg />
                        <span>Гідро-бур</span>
                    </div>
                </div>
            </div>
        </div>
    );
}
